Model: "functional_9"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to
==================================================================================================
input_1 (InputLayer)            [(None, 512, 512, 3) 0
__________________________________________________________________________________________________
zero_padding2d (ZeroPadding2D)  (None, 514, 514, 3)  0           input_1[0][0]
__________________________________________________________________________________________________
conv2d (Conv2D)                 (None, 512, 512, 64) 1792        zero_padding2d[0][0]
__________________________________________________________________________________________________
batch_normalization (BatchNorma (None, 512, 512, 64) 256         conv2d[0][0]
__________________________________________________________________________________________________
activation (Activation)         (None, 512, 512, 64) 0           batch_normalization[0][0]
__________________________________________________________________________________________________
max_pooling2d (MaxPooling2D)    (None, 256, 256, 64) 0           activation[0][0]
__________________________________________________________________________________________________
zero_padding2d_1 (ZeroPadding2D (None, 258, 258, 64) 0           max_pooling2d[0][0]
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, 256, 256, 128 73856       zero_padding2d_1[0][0]
__________________________________________________________________________________________________
batch_normalization_1 (BatchNor (None, 256, 256, 128 512         conv2d_1[0][0]
__________________________________________________________________________________________________
activation_1 (Activation)       (None, 256, 256, 128 0           batch_normalization_1[0][0]
__________________________________________________________________________________________________
max_pooling2d_1 (MaxPooling2D)  (None, 128, 128, 128 0           activation_1[0][0]
__________________________________________________________________________________________________
zero_padding2d_2 (ZeroPadding2D (None, 130, 130, 128 0           max_pooling2d_1[0][0]
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (None, 128, 128, 256 295168      zero_padding2d_2[0][0]
__________________________________________________________________________________________________
batch_normalization_2 (BatchNor (None, 128, 128, 256 1024        conv2d_2[0][0]
__________________________________________________________________________________________________
activation_2 (Activation)       (None, 128, 128, 256 0           batch_normalization_2[0][0]
__________________________________________________________________________________________________
max_pooling2d_2 (MaxPooling2D)  (None, 64, 64, 256)  0           activation_2[0][0]
__________________________________________________________________________________________________
zero_padding2d_3 (ZeroPadding2D (None, 66, 66, 256)  0           max_pooling2d_2[0][0]
__________________________________________________________________________________________________
conv2d_3 (Conv2D)               (None, 64, 64, 256)  590080      zero_padding2d_3[0][0]
__________________________________________________________________________________________________
batch_normalization_3 (BatchNor (None, 64, 64, 256)  1024        conv2d_3[0][0]
__________________________________________________________________________________________________
activation_3 (Activation)       (None, 64, 64, 256)  0           batch_normalization_3[0][0]
__________________________________________________________________________________________________
max_pooling2d_3 (MaxPooling2D)  (None, 32, 32, 256)  0           activation_3[0][0]
__________________________________________________________________________________________________
zero_padding2d_4 (ZeroPadding2D (None, 34, 34, 256)  0           max_pooling2d_3[0][0]
__________________________________________________________________________________________________
conv2d_4 (Conv2D)               (None, 32, 32, 256)  590080      zero_padding2d_4[0][0]
__________________________________________________________________________________________________
batch_normalization_4 (BatchNor (None, 32, 32, 256)  1024        conv2d_4[0][0]
__________________________________________________________________________________________________
activation_4 (Activation)       (None, 32, 32, 256)  0           batch_normalization_4[0][0]
__________________________________________________________________________________________________
max_pooling2d_4 (MaxPooling2D)  (None, 16, 16, 256)  0           activation_4[0][0]
__________________________________________________________________________________________________
conv2d_5 (Conv2D)               (None, 16, 16, 4096) 51384320    max_pooling2d_4[0][0]
__________________________________________________________________________________________________
dropout (Dropout)               (None, 16, 16, 4096) 0           conv2d_5[0][0]
__________________________________________________________________________________________________
conv2d_6 (Conv2D)               (None, 16, 16, 4096) 16781312    dropout[0][0]
__________________________________________________________________________________________________
dropout_1 (Dropout)             (None, 16, 16, 4096) 0           conv2d_6[0][0]
__________________________________________________________________________________________________
conv2d_7 (Conv2D)               (None, 16, 16, 4)    16388       dropout_1[0][0]
__________________________________________________________________________________________________
conv2d_transpose (Conv2DTranspo (None, 34, 34, 4)    256         conv2d_7[0][0]
__________________________________________________________________________________________________
cropping2d (Cropping2D)         (None, 34, 32, 4)    0           conv2d_transpose[0][0]
__________________________________________________________________________________________________
cropping2d_1 (Cropping2D)       (None, 32, 32, 4)    0           cropping2d[0][0]
__________________________________________________________________________________________________
conv2d_8 (Conv2D)               (None, 32, 32, 4)    1028        max_pooling2d_3[0][0]
__________________________________________________________________________________________________
add (Add)                       (None, 32, 32, 4)    0           cropping2d_1[0][0]
                                                                 conv2d_8[0][0]
__________________________________________________________________________________________________
conv2d_transpose_1 (Conv2DTrans (None, 66, 66, 4)    256         add[0][0]
__________________________________________________________________________________________________
cropping2d_2 (Cropping2D)       (None, 66, 64, 4)    0           conv2d_transpose_1[0][0]
__________________________________________________________________________________________________
conv2d_9 (Conv2D)               (None, 64, 64, 4)    1028        max_pooling2d_2[0][0]
__________________________________________________________________________________________________
cropping2d_3 (Cropping2D)       (None, 64, 64, 4)    0           cropping2d_2[0][0]
__________________________________________________________________________________________________
seg_feats (Add)                 (None, 64, 64, 4)    0           conv2d_9[0][0]
                                                                 cropping2d_3[0][0]
__________________________________________________________________________________________________
conv2d_transpose_2 (Conv2DTrans (None, 512, 512, 4)  1024        seg_feats[0][0]
__________________________________________________________________________________________________
conv2d_10 (Conv2D)              (None, 512, 512, 4)  20          conv2d_transpose_2[0][0]
==================================================================================================
Total params: 69,740,448
Trainable params: 69,738,528
Non-trainable params: 1,920