Model: "functional_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
input_1 (InputLayer)         [(None, 512, 512, 3)]     0
_________________________________________________________________
zero_padding2d (ZeroPadding2 (None, 514, 514, 3)       0
_________________________________________________________________
conv2d (Conv2D)              (None, 512, 512, 64)      1792
_________________________________________________________________
batch_normalization (BatchNo (None, 512, 512, 64)      256
_________________________________________________________________
activation (Activation)      (None, 512, 512, 64)      0
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 256, 256, 64)      0
_________________________________________________________________
zero_padding2d_1 (ZeroPaddin (None, 258, 258, 64)      0
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 256, 256, 128)     73856
_________________________________________________________________
batch_normalization_1 (Batch (None, 256, 256, 128)     512
_________________________________________________________________
activation_1 (Activation)    (None, 256, 256, 128)     0
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 128, 128, 128)     0
_________________________________________________________________
zero_padding2d_2 (ZeroPaddin (None, 130, 130, 128)     0
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 128, 128, 256)     295168
_________________________________________________________________
batch_normalization_2 (Batch (None, 128, 128, 256)     1024
_________________________________________________________________
activation_2 (Activation)    (None, 128, 128, 256)     0
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 64, 64, 256)       0
_________________________________________________________________
zero_padding2d_3 (ZeroPaddin (None, 66, 66, 256)       0
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 64, 64, 256)       590080
_________________________________________________________________
batch_normalization_3 (Batch (None, 64, 64, 256)       1024
_________________________________________________________________
activation_3 (Activation)    (None, 64, 64, 256)       0
_________________________________________________________________
max_pooling2d_3 (MaxPooling2 (None, 32, 32, 256)       0
_________________________________________________________________
zero_padding2d_5 (ZeroPaddin (None, 34, 34, 256)       0
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 32, 32, 512)       1180160
_________________________________________________________________
batch_normalization_5 (Batch (None, 32, 32, 512)       2048
_________________________________________________________________
up_sampling2d (UpSampling2D) (None, 64, 64, 512)       0
_________________________________________________________________
zero_padding2d_6 (ZeroPaddin (None, 66, 66, 512)       0
_________________________________________________________________
conv2d_6 (Conv2D)            (None, 64, 64, 256)       1179904
_________________________________________________________________
batch_normalization_6 (Batch (None, 64, 64, 256)       1024
_________________________________________________________________
up_sampling2d_1 (UpSampling2 (None, 128, 128, 256)     0
_________________________________________________________________
zero_padding2d_7 (ZeroPaddin (None, 130, 130, 256)     0
_________________________________________________________________
conv2d_7 (Conv2D)            (None, 128, 128, 128)     295040
_________________________________________________________________
batch_normalization_7 (Batch (None, 128, 128, 128)     512
_________________________________________________________________
up_sampling2d_2 (UpSampling2 (None, 256, 256, 128)     0
_________________________________________________________________
zero_padding2d_8 (ZeroPaddin (None, 258, 258, 128)     0
_________________________________________________________________
conv2d_8 (Conv2D)            (None, 256, 256, 128)     147584
_________________________________________________________________
batch_normalization_8 (Batch (None, 256, 256, 128)     512
_________________________________________________________________
up_sampling2d_3 (UpSampling2 (None, 512, 512, 128)     0
_________________________________________________________________
zero_padding2d_9 (ZeroPaddin (None, 514, 514, 128)     0
_________________________________________________________________
seg_feats (Conv2D)           (None, 512, 512, 64)      73792
_________________________________________________________________
batch_normalization_9 (Batch (None, 512, 512, 64)      256
_________________________________________________________________
conv2d_9 (Conv2D)            (None, 512, 512, 4)       2308
_________________________________________________________________
conv2d_10 (Conv2D)           (None, 512, 512, 4)       20
=================================================================
Total params: 3,846,872
Trainable params: 3,843,288
Non-trainable params: 3,584
